<?php
/**
 * 人人站CMS
 * ============================================================================
 * 版权所有 2015-2030 山东康程信息科技有限公司，并保留所有权利。
 * 网站地址: http://www.rrzcms.com
 * ----------------------------------------------------------------------------
 * 如果商业用途务必到官方购买正版授权, 以免引起不必要的法律纠纷.
 * ============================================================================
 */

/**
 * 中文简体
 */
return [
    '主页' => '主页',
    '首页' => '首页',
    '上一页' => '上一页',
    '下一页' => '下一页',
    '末页' => '末页',
    '共' => '共',
    '页' => '页',
    '条' => '条',
    '第%s页' => '第%s页',
    '搜索页' => '搜索页',
    '品牌页' => '品牌页',
    '文章搜索页' => '文章搜索页',
    '产品搜索页' => '产品搜索页',
    '文章搜索' => '文章搜索',
    '产品搜索' => '产品搜索',
    '表单不存在！' => '表单不存在！',
    '不能为空！' => '不能为空！',
    '提交的内容无效！' => '提交的内容无效！',
    '提交成功！' => '提交成功！',
    '非法参数！' => '非法参数！',
    '页面不存在！' => '页面不存在！',
    '文章不存在！' => '文章不存在！',
    '文章尚未发布！' => '文章尚未发布！',
    '文章节点不存在！' => '文章节点不存在！',
    '产品分类不存在！' => '产品分类不存在！',
    '产品不存在！' => '产品不存在！',
    '文章栏目尚未发布！' => '文章栏目尚未发布！',
    '产品分类尚未发布！' => '产品分类尚未发布！',
    '网站暂时关闭，维护中……' => '网站暂时关闭，维护中……',
];