<?php
/**
 * 人人站CMS
 * ============================================================================
 * 版权所有 2015-2030 山东康程信息科技有限公司，并保留所有权利。
 * 网站地址: http://www.rrzcms.com
 * ----------------------------------------------------------------------------
 * 如果商业用途务必到官方购买正版授权, 以免引起不必要的法律纠纷.
 * ============================================================================
 */

/**
 * 日文
 */
return [
    '主页' => 'ホームページ',
    '首页' => '最初のページ',
    '上一页' => '前のページ',
    '下一页' => '次のページ',
    '末页' => '最後のページ',
    '共' => '全部で',
    '页' => 'ページ',
    '条' => 'レコード',
    '第%s页' => '第%sページ',
    '搜索页' => '検索ページ',
    '品牌页' => 'ブランド',
    '文章搜索页' => '記事検索ページ',
    '产品搜索页' => '商品の検索ページ',
    '文章搜索' => '記事検索',
    '产品搜索' => '商品の検索',
    '表单不存在！' => 'フォームは存在しません',
    '不能为空！' => '暇ではない！',
    '提交的内容无效！' => '提出内容は無効です。',
    '提交成功！' => '提出成功！',
    '非法参数！' => '不正なパラメータ！',
    '页面不存在！' => 'ページは存在しません',
    '文章不存在！' => '文章は存在しません',
    '文章尚未发布！' => 'まだ発表されていません。',
    '文章节点不存在！' => '文章のノードは存在しません。',
    '产品分类不存在！' => '製品の分類は存在しません！',
    '产品不存在！' => '製品は存在しません',
    '文章栏目尚未发布！' => '文章の欄はまだ発表されていない。',
    '产品分类尚未发布！' => '製品の分類はまだ発表されていません。',
    '网站暂时关闭，维护中……' => 'サイトは一時的に閉鎖され、メンテナンス中です。',
];