<?php
/**
 * 人人站CMS
 * ============================================================================
 * 版权所有 2015-2030 山东康程信息科技有限公司，并保留所有权利。
 * 网站地址: http://www.rrzcms.com
 * ----------------------------------------------------------------------------
 * 如果商业用途务必到官方购买正版授权, 以免引起不必要的法律纠纷.
 * ============================================================================
 */

/**
 * 朝鲜文
 */
return [
    '主页' => '홈 페이지',
    '首页' => '홈 페이지',
    '上一页' => '이전 페이지',
    '下一页' => '다음 페이지',
    '末页' => '마지막 페이지',
    '共' => '모두',
    '页' => '페이지.',
    '条' => '기록 하 다.',
    '第%s页' => '%s 페이지',
    '搜索页' => '검색 페이지',
    '品牌页' => '브랜드 페이지',
    '文章搜索页' => '문장 검색 페이지',
    '产品搜索页' => '제품 검색 페이지',
    '文章搜索' => '문장 검색',
    '产品搜索' => '제품 검색',
    '表单不存在！' => '양식 이 존재 하지 않 습 니 다!',
    '不能为空！' => '비 어 있 으 면 안 돼!',
    '提交的内容无效！' => '제출 한 내용 이 무효 입 니 다!',
    '提交成功！' => '제출 성공!',
    '非法参数！' => '불법 매개 변수!',
    '页面不存在！' => '페이지 가 존재 하지 않 습 니 다!',
    '文章不存在！' => '글 이 존재 하지 않 습 니 다!',
    '文章尚未发布！' => '글 이 아직 발표 되 지 않 았 습 니 다!',
    '文章节点不存在！' => '문장 노드 가 존재 하지 않 습 니 다!',
    '产品分类不存在！' => '제품 분류 가 존재 하지 않 습 니 다!',
    '产品不存在！' => '제품 이 존재 하지 않 습 니 다!',
    '文章栏目尚未发布！' => '글 노드 가 아직 발표 되 지 않 았 습 니 다.',
    '产品分类尚未发布！' => '제품 분류 가 아직 발표 되 지 않 았 다.',
    '网站暂时关闭，维护中……' => '사이트 일시 폐쇄, 유지 보수 중',
];