<?php
/**
 * 人人站CMS
 * ============================================================================
 * 版权所有 2015-2030 山东康程信息科技有限公司，并保留所有权利。
 * 网站地址: http://www.rrzcms.com
 * ----------------------------------------------------------------------------
 * 如果商业用途务必到官方购买正版授权, 以免引起不必要的法律纠纷.
 * ============================================================================
 */

/**
 * 中文繁体
 */
return [
    '主页' => '主頁',
    '首页' => '首頁',
    '上一页' => '上一頁',
    '下一页' => '下一頁',
    '末页' => '末頁',
    '共' => '共',
    '页' => '頁',
    '条' => '條',
    '第%s页' => '第%s页',
    '搜索页' => '搜索頁',
    '品牌页' => '品牌頁',
    '文章搜索页' => '文章搜索頁',
    '产品搜索页' => '産品搜索頁',
    '文章搜索' => '文章搜索',
    '产品搜索' => '産品搜索',
    '表单不存在！' => '表單不存在！',
    '不能为空！' => '不能爲空！',
    '提交的内容无效！' => '提交的內容無效！',
    '提交成功！' => '提交成功！',
    '非法参数！' => '非法參數！',
    '页面不存在！' => '頁面不存在！',
    '文章不存在！' => '文章不存在！',
    '文章尚未发布！' => '文章尚未發布！',
    '文章节点不存在！' => '文章節點不存在！',
    '产品分类不存在！' => '産品分類不存在！',
    '产品不存在！' => '産品不存在！',
    '文章栏目尚未发布！' => '文章欄目尚未發佈！',
    '产品分类尚未发布！' => '產品分類尚未發佈！',
    '网站暂时关闭，维护中……' => '網站暫時關閉，維護中……',
];